; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 5986)
	(= (fuel plane1) 855)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at person1 city5)
	(at person2 city3)
	(at person3 city0)
	(at person4 city1)
	(at person5 city4)
	(at person6 city2)
	(at person7 city5)
	(at person8 city5)
	(at person9 city0)
	(at person10 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 985)
	(= (distance city0 city2) 883)
	(= (distance city0 city3) 779)
	(= (distance city0 city4) 705)
	(= (distance city0 city5) 991)
	(= (distance city0 city6) 941)
	(= (distance city0 city7) 622)
	(= (distance city0 city8) 622)
	(= (distance city0 city9) 676)
	(= (distance city1 city0) 985)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 723)
	(= (distance city1 city3) 735)
	(= (distance city1 city4) 812)
	(= (distance city1 city5) 752)
	(= (distance city1 city6) 724)
	(= (distance city1 city7) 784)
	(= (distance city1 city8) 840)
	(= (distance city1 city9) 853)
	(= (distance city2 city0) 883)
	(= (distance city2 city1) 723)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 981)
	(= (distance city2 city4) 719)
	(= (distance city2 city5) 802)
	(= (distance city2 city6) 555)
	(= (distance city2 city7) 850)
	(= (distance city2 city8) 720)
	(= (distance city2 city9) 884)
	(= (distance city3 city0) 779)
	(= (distance city3 city1) 735)
	(= (distance city3 city2) 981)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 890)
	(= (distance city3 city5) 620)
	(= (distance city3 city6) 575)
	(= (distance city3 city7) 578)
	(= (distance city3 city8) 865)
	(= (distance city3 city9) 833)
	(= (distance city4 city0) 705)
	(= (distance city4 city1) 812)
	(= (distance city4 city2) 719)
	(= (distance city4 city3) 890)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 608)
	(= (distance city4 city6) 850)
	(= (distance city4 city7) 716)
	(= (distance city4 city8) 888)
	(= (distance city4 city9) 556)
	(= (distance city5 city0) 991)
	(= (distance city5 city1) 752)
	(= (distance city5 city2) 802)
	(= (distance city5 city3) 620)
	(= (distance city5 city4) 608)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 708)
	(= (distance city5 city7) 829)
	(= (distance city5 city8) 678)
	(= (distance city5 city9) 830)
	(= (distance city6 city0) 941)
	(= (distance city6 city1) 724)
	(= (distance city6 city2) 555)
	(= (distance city6 city3) 575)
	(= (distance city6 city4) 850)
	(= (distance city6 city5) 708)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 505)
	(= (distance city6 city8) 901)
	(= (distance city6 city9) 565)
	(= (distance city7 city0) 622)
	(= (distance city7 city1) 784)
	(= (distance city7 city2) 850)
	(= (distance city7 city3) 578)
	(= (distance city7 city4) 716)
	(= (distance city7 city5) 829)
	(= (distance city7 city6) 505)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 818)
	(= (distance city7 city9) 654)
	(= (distance city8 city0) 622)
	(= (distance city8 city1) 840)
	(= (distance city8 city2) 720)
	(= (distance city8 city3) 865)
	(= (distance city8 city4) 888)
	(= (distance city8 city5) 678)
	(= (distance city8 city6) 901)
	(= (distance city8 city7) 818)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 790)
	(= (distance city9 city0) 676)
	(= (distance city9 city1) 853)
	(= (distance city9 city2) 884)
	(= (distance city9 city3) 833)
	(= (distance city9 city4) 556)
	(= (distance city9 city5) 830)
	(= (distance city9 city6) 565)
	(= (distance city9 city7) 654)
	(= (distance city9 city8) 790)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city9)
	(at person1 city2)
	(at person2 city8)
	(at person3 city3)
	(at person4 city7)
	(at person5 city3)
	(at person6 city5)
	(at person7 city0)
	(at person8 city3)
	(at person10 city6)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 855 to 5986
   goals met: 0 of 10
2. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 10
3. (fly plane1 city2 city9)
   deleted: (at plane1 city2)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 0 to 1768, (fuel plane1) from 5986 to 4218
   goals met: 1 of 10
4. (zoom plane1 city9 city4)
   deleted: (at plane1 city9)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 1768 to 3992, (fuel plane1) from 4218 to 1994
   goals met: 0 of 10
5. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 10
6. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 3992 to 5208, (fuel plane1) from 1994 to 778
   goals met: 0 of 10
7. (debark person6 plane1 city5)
   deleted: (in person6 plane1)
   added: (at person6 city5)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 10
8. (refuel plane1 city5)
   changed: (fuel plane1) from 778 to 5986
   goals met: 1 of 10
9. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 10
10. (board person7 plane1 city5)
   deleted: (at person7 city5)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 10
11. (board person8 plane1 city5)
   deleted: (at person8 city5)
   added: (in person8 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 1 of 10
12. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 5208 to 7190, (fuel plane1) from 5986 to 4004
   goals met: 1 of 10
13. (debark person7 plane1 city0)
   deleted: (in person7 plane1)
   added: (at person7 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 2 of 10
14. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 2 of 10
15. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 7190 to 8956, (fuel plane1) from 4004 to 2238
   goals met: 2 of 10
16. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 4 to 3
   goals met: 3 of 10
17. (fly plane1 city2 city9)
   deleted: (at plane1 city2)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 8956 to 10724, (fuel plane1) from 2238 to 470
   goals met: 4 of 10
18. (refuel plane1 city9)
   changed: (fuel plane1) from 470 to 5986
   goals met: 4 of 10
19. (fly plane1 city9 city3)
   deleted: (at plane1 city9)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 10724 to 12390, (fuel plane1) from 5986 to 4320
   goals met: 3 of 10
20. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 10
21. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 10
22. (debark person8 plane1 city3)
   deleted: (in person8 plane1)
   added: (at person8 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 10
23. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 10
24. (fly plane1 city3 city8)
   deleted: (at plane1 city3)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 12390 to 14120, (fuel plane1) from 4320 to 2590
   goals met: 6 of 10
25. (debark person2 plane1 city8)
   deleted: (in person2 plane1)
   added: (at person2 city8)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
26. (fly plane1 city8 city9)
   deleted: (at plane1 city8)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 14120 to 15700, (fuel plane1) from 2590 to 1010
   goals met: 8 of 10
27. (refuel plane1 city9)
   changed: (fuel plane1) from 1010 to 5986
   goals met: 8 of 10
28. (fly plane1 city9 city6)
   deleted: (at plane1 city9)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 15700 to 16830, (fuel plane1) from 5986 to 4856
   goals met: 7 of 10
29. (fly plane1 city6 city1)
   deleted: (at plane1 city6)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 16830 to 18278, (fuel plane1) from 4856 to 3408
   goals met: 7 of 10
30. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 10
31. (board person10 plane1 city1)
   deleted: (at person10 city1)
   added: (in person10 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 10
32. (fly plane1 city1 city7)
   deleted: (at plane1 city1)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 18278 to 19846, (fuel plane1) from 3408 to 1840
   goals met: 7 of 10
33. (debark person4 plane1 city7)
   deleted: (in person4 plane1)
   added: (at person4 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 10
34. (fly plane1 city7 city9)
   deleted: (at plane1 city7)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 19846 to 21154, (fuel plane1) from 1840 to 532
   goals met: 9 of 10
35. (refuel plane1 city9)
   changed: (fuel plane1) from 532 to 5986
   goals met: 9 of 10
36. (fly plane1 city9 city6)
   deleted: (at plane1 city9)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 21154 to 22284, (fuel plane1) from 5986 to 4856
   goals met: 8 of 10
37. (debark person10 plane1 city6)
   deleted: (in person10 plane1)
   added: (at person10 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
38. (fly plane1 city6 city9)
   deleted: (at plane1 city6)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 22284 to 23414, (fuel plane1) from 4856 to 3726
   goals met: 10 of 10
